Repository: centos-fedora-archive-updated/a2ps
Catalog: po/*.po
Languages: cs, tr

source: missing argument for `%s'
cs: chybí argument pro `%s'
tr: `%s' için eksik argüman

source: cannot create file `%s'
cs: soubor `%s' nelze vytvoøit
tr: `%s' dosyasý yaratýlamýyor

source: cannot open a pipe on `%s'
cs: rouru do `%s' nelze otevøít
tr: `%s' üzerinde pipe açýlamýyor

source: Delegation `%s', from %s to %s
cs: Pøedání `%s', od %s do %s
tr: Üstlenici `%s', %s -> %s

source: Applications configured for delegation
cs: Aplikace urèené k pøedávání úloh
tr: Üstlenici olarak ayarlanan uygulamalar

source: `%s' is a directory
cs: `%s' je adresáø
tr: `%s' bir dizin

source: cannot open file `%s'
cs: soubor `%s' nelze otevøít
tr: `%s' dosyasý açýlamýyor

source: cannot get informations on file `%s'
cs: informace o souboru `%s' nelze získat
tr: `%s' dosyasý ile ilgili bilgi alýnamýyor

source: [%s (%s): 1 page on 1 sheet]
cs: [%s (%s): poèet stran/listù: 1/1]
tr: [%s (%s): 1 sayfa / 1 kaðýt]

source: [Total: 1 page on 1 sheet] %s
cs: [Celkem: poèet stran/listù: 1/1] %s
tr: [Toplam: 1 sayfa / 1 kaðýt] %s

source: [No output produced]
cs: [®ádný výstup nebyl vytvoøen]
tr: [Çýktý üretilmedi]

source: %s, delegated to %s
cs: %s pøedáno ke zpracování %s
tr: %s, %s uygulamasýna devredildi

source: [%s (%s): failed. Ignored]
cs: [%s (%s): neuspìlo. Ignorováno]
tr: [%s (%s): baþarýsýz. Gözardý edildi]

source: [%s (unprintable): ignored]
cs: [%s (netisknutelné): Ignorováno]
tr: [%s (basýlamaz): gözardý edildi]

source: [%s (binary): ignored]
cs: [%s (binární data): ignorováno]
tr: [%s (ikili): gözardý edildi]

source: plain
cs: prostý
tr: sade

source: end-of-line in string constant
cs: neukonèená øetìzcová konstanta
tr: katar sabitinde satýr-sonu

source: heavy
cs: maximální (heavy)
tr: çok

source: normal
cs: bì¾ná (normal)

source: none
cs: ¾ádná (none)
tr: yok

source: yes
cs: ano
tr: evet

source: no
cs: ne
tr: hayýr

source: Configuration status of %s %s
cs: Aktuální konfigurace %s %s
tr: %s için ayar durumu %s

source: Sheets:
cs: Listy:
tr: Kaðýtlar:

source: portrait
cs: na vý¹ku
tr: boyuna

source: landscape
cs: na ¹íøku
tr: enine

source: font size is %gpt
cs: velikost písma je %gpt
tr: yazýtipi boyu: %gpt

source: each line
cs: ka¾dý øádek
tr: her satýr

source: Virtual pages:
cs: Virtuální stránky:
tr: Sanal sayfalar:

source: Headers:
cs: Hlavièky:
tr: Üstyazýlar:

source: header = %s left footer = %s footer = %s right footer = %s left title = %s center title = %s right title = %s under lay = %s
cs: hlavièka = %s levá odrá¾ka = %s odrá¾ka = %s pravá odrá¾ka = %s levý titulek = %s centrální titulek = %s pravý titulek = %s zápatí = %s
tr: üstyazý = %s sol altyazý = %s altyazý = %s sað altyazý = %s sol baþlýk = %s orta baþlýk = %s sað baþlýk = %s dipyazý = %s

source: Input:
cs: Vstup:
tr: Girdi:

source: truncate lines = %s interpret = %s end of line = %s encoding = %s document title = %s prologue = %s print anyway = %s delegating = %s
cs: oøezávání øádkù = %s interpret = %s konec øádku = %s kódování = %s titul dokumentu = %s prolog = %s tisk binárních dat = %s pøedávání úloh = %s
tr: satýrlarý kýrp = %s yorumla = %s satýr sonu = %s kodlama = %s belge baþlýðý = %s giriþ = %s yine de bas = %s üstlenici = %s

source: selected automatically
cs: automatická volba
tr: kendiliðinden seçildi

source: Pretty-printing:
cs: Tisk stylù:
tr: Süslü-basým:

source: style sheet = %s highlight level = %s strip level = %d
cs: styl = %s úroveò zvýrazòování = %s úroveò oøezávání komentáøù = %d
tr: stil dosyasý = %s renklendirme düzeyi = %s ayýklama düzeyi = %d

source: never make backups
cs: ¾ádné zálo¾ní kopie
tr: asla yedek alma

source: simple backups of every file
cs: jednoduché zálo¾ní kopie ka¾dého souboru
tr: her dosyanýn basit yedeðini al

source: numbered backups of files already numbered, and simple of others
cs: èíslované zálo¾ní kopie èíslovaných souborù a jednoduché ostatních
tr: numaralý dosyalarýn numaralý, diðerlerinin basit yedeklerini al

source: numbered backups of every file
cs: èíslované zálo¾ní kopie v¹ech souborù
tr: her dosyanýn numaralý yedeðini al

source: Output:
cs: Výstup:
tr: Çýktý:

source: destination = %s version control = %s backup suffix = %s
cs: cíl = %s kontrola verzí = %s pøípona zálo¾ních kopií = %s
tr: varýþ = %s sürüm denetimi = %s yedek soneki = %s

source: statusdict definitions =
cs: nastavení 'statusdict' =
tr: statusdict tanýmlarý =

source: Internals:
cs: Interní nastavení:
tr: Ýç Ayrýntýlar:

source: Tasks:
cs: Úlohy:

source: --version display version --help display this help --guess report guessed types of FILES --which report the full path of library files named FILES --glob report the full path of library files matching FILES --list=defaults display default settings and parameters --list=TOPIC detailed list on TOPIC (delegations, encodings, features, variables, media, ppd, printers, prologues, style-sheets, user-options)
cs: --version vypí¹e oznaèení verze programu --help vypí¹e tuto nápovìdu --guess vypí¹e pøedpokládaný typ SOUBORÙ --which vypí¹e úplnou cestu k zadaným knihovním SOUBORÙM --glob vypí¹e úplnou cestu ke knihovním SOUBORÙM vyhovujícím vzoru --list=defaults vypí¹e implicitní nastavení a parametry --list=TÉMA vypí¹e informace o TÉMATU (delegations, encodings, features, variables, media, ppd printers, prologues, style-sheets, user-options

source: After having performed the task, exit successfully. Detailed lists may provide additional help on specific features.
cs: Úloha byla úspì¹nì dokonèena. Nápovìdu ke konkrétním tématùm poskytne podrobný výpis.

source: Global:
cs: V¹eobecná nastavení:
tr: Genel:

source: -q, --quiet, --silent be really quiet -v, --verbose[=LEVEL] set verbosity on, or to LEVEL -=, --user-option=OPTION use the user defined shortcut OPTION --debug enable debugging features -D, --define=KEY[:VALUE] unset variable KEY or set to VALUE
cs: -q, --quiet, --silent minimální informace o bìhu programu -v, --verbose[=ÚROVEÒ] úroveò výpisu hlá¹ek zapnuta, nebo nastavena na ÚROVEÒ -=, --user-option=ZKRATKA pou¾ije u¾ivatelem definovanou ZKRATKU --debug pou¾ije ladící funkce -D, --define=KLÍÈ[:HODNOTA] zru¹í nebo nastaví promìnnou K na hodnotu H
tr: -q, --quiet, --silent gerçekten sessiz ol -v, --verbose[=DÜZEY] geveze kipe geç ya da DÜZEY olarak ayarla -=, --user-option=SEÇENEK kullanýcý tanýmlý SEÇENEK kestirmesini kullan --debug hata ayýklama yeteneklerini aç -D, --define=ANAHTAR[:DEÐER] ANAHTAR deðiþkenini sil ya da DEÐER ata

source: --line-numbers=NUM precede each NUM lines with its line number -C alias for --line-numbers=5 -f, --font-size=SIZE use font SIZE (float) for the body text -L, --lines-per-page=NUM scale the font to print NUM lines per virtual -l, --chars-per-line=NUM scale the font to print NUM columns per virtual -m, --catman process FILE as a man page (same as -L66) -T, --tabsize=NUM set tabulator size to NUM --non-printable-format=FMT specify how non-printable chars are printed
cs: --line-numbers=ÈÍSLO pøedøadí ka¾dému ÈÍSLO. øádku jeho èíslo -C pøezdívka pro --line-numbers=5 -f, --font-size=VELIKOST VELIKOST (float) písma pro hlavní text -L, --lines-per-page=POÈET pøepoèítá písmo, aby tiskl POÈET øádkù na stránku -l, --chars-per-line=POÈET pøepoèítá písmo, aby tiskl POÈET sloupcù na stránku -m, --catman zpracuje SOUBOR jako man (stejné jako -L66) -T, --tabsize=VELIKOST nastaví VELIKOST tabulátoru --non-printable-format=FMT nastaví zpùsob zpracování netisknutelných znakù
tr: --line-numbers=SAYI her SAYI satýrýn önüne satýr numarasý ekle -C --line-numbers=5 yerine geçer -f, --font-size=BOY metin için BOY (float) yazýtipini kullan -L, --lines-per-page=SAYI her sanal sayfaya SAYI satýr basýlacak þekilde yazýtipini ölçekle -l, --chars-per-line=SAYI her sanal sayfaya SAYI sütun basýlacak þekilde yazýtipini ölçekle -m, --catman dosyayý man sayfasý olarak iþle (-L66 ile ayný) -T, --tabsize=SAYI tab boyuna SAYI deðerini ver --non-printable-format=FMT basýlamaz karakterlerin nasýl basýlacaðýný belirt

source: Headings:
cs: Hlavièky:
tr: Baþlýklar:

source: -B, --no-header no page headers at all -b, --header[=TEXT] set page header -u, --underlay[=TEXT] print TEXT under every page --center-title[=TEXT] set page title to TITLE --left-title[=TEXT] set left and right page title to TEXT --right-title[=TEXT] --left-footer[=TEXT] set sheet footers to TEXT --footer[=TEXT] --right-footer[=TEXT]
cs: -B, --no-header stránky bez hlavièek -b, --header[=TEXT] nastaví hlavièky na TEXT -u, --underlay[=TEXT] nastaví patièky na TEXT --center-title[=TEXT] nastaví titulek stránek na TEXT --left-title[=TEXT] nastaví levý a pravý titulek stránek na TEXT --right-title[=TEXT] --left-footer[=TEXT] nastaví odrá¾ky na TEXT --footer[=TEXT] --right-footer[=TEXT]

source: The TEXTs may use special escapes.
cs: Vstup mù¾e pou¾ívat zvlá¹tní øídící znaky.

source: -a, --pages[=RANGE] select the pages to print -c, --truncate-lines* cut long lines -i, --interpret* interpret tab, bs and ff chars --end-of-line=TYPE specify the eol char (TYPE: r, n, nr, rn, any) -X, --encoding=NAME use input encoding NAME -t, --title=NAME set the name of the job --stdin=NAME set the name of the input file stdin --print-anyway* force binary printing -Z, --delegate* delegate files to another application --toc[=TEXT] generate a table of content
cs: -a, --pages[=ROZSAH] zvolí stránky k vyti¹tìní -c, --truncate-lines* oøezává dlouhé øádky -i, --interpret* interpretace tab, bs a ff znakù --end-of-line=TYP nastaví znak eol (TYP:r, n, nr, rn, any) -X, --encoding=JMÉNO pou¾ije vstupní kódování JMÉNO -t, --title=JMÉNO nastaví JMÉNO úlohy --stdin=SOUBOR ète SOUBOR ze standardního vstupu --print-anyway* tiskne také binární data -Z, --delegate* pøedá soubory ke zpracování jiné aplikaci --toc[=TEXT] vytvoøí obsah
tr: -a, --pages[=ARALIK] basýlacak sayfalarý seç -c, --truncate-lines* uzun satýrlarý kýrp -i, --interpret* tab, bs ve ff karakterlerini yorumla --end-of-line=TÝP satýr-sonu karakterini belirt (TÝP: r, n, nr, rn, any) -X, --encoding=ÝSÝM ÝSÝM giriþ kodlamasýný kullan -t, --title=ÝSÝM iþe isim ver --stdin=ÝSÝM standart giriþ dosyasýna isim ver --print-anyway* ikili düzende basmayý zorla -Z, --delegate* dosyalarý baþka bir uygulamaya devret --toc[=METÝN] içindekiler bölümü oluþtur

source: When delegations are enabled, a2ps may use other applications to handle the processing of files that should not be printed as raw information, e.g., HTML PostScript, PDF etc.
cs: Pokud je zapnuto pøedávání úloh, pak a2ps mù¾e pro zpracování souborù, které nemají být vyti¹tìny v pøímém formátu (napø. HTML, PostScript èi PDF, pou¾ít jiné aplikace.

source: -E, --pretty-print[=LANG] enable pretty-printing (set style to LANG) --highlight-level=LEVEL set pretty printing highlight LEVEL LEVEL can be none, normal or heavy -g alias for --highlight-level=heavy --strip-level=NUM level of comments stripping
cs: -E, --pretty-print[=STYL] zapne tisk stylù ( = STYL) --highlight-level=ÚROVEÒ nastaví ÚROVEÒ zvýrazòování pøi tisku stylù ÚROVEÒ mù¾e být none, normal nebo heavy -g alias pro --highlight-level=heavy --strip-level=ÚROVEÒ ÚROVEÒ oøezávání komentáøù
tr: -E, --pretty-print[=DÝL] süslü-basýmý aç (stili DÝL olarak ayarla) --highlight-level=DÜZEY süslü-basým renklendirme DÜZEYini ayarla DÜZEY none, normal ya da heavy olabilir -g --highlight-level=heavy ile ayný --strip-level=NUM yorum ayýklama düzeyi

source: --prologue=FILE include FILE.pro as PostScript prologue --ppd[=KEY] automatic PPD selection or set to KEY -n, --copies=NUM print NUM copies of each page -s, --sides=MODE set the duplex MODE (`1' or `simplex', `2' or `duplex', `tumble') -S, --setpagedevice=K[:V] pass a page device definition to output --statusdict=K[:[:]V] pass a statusdict definition to the output -k, --page-prefeed enable page prefeed -K, --no-page-prefeed disable page prefeed
cs: --prologue=SOUBOR vlo¾í SOUBOR.pro jako PostScriptový prolog --ppd[=KLÍÈ] automatická volba PPD nebo nastaví na KLÍÈ -n, --copies=POÈET vytiskne POÈET kopií ka¾dé stránky -s, --sides=RE®IM poèet stran na papír (`1' èi `simplex', `2' èi `duplex', `tumble') -S, --setpagedevice=K[:V] po¹le na výstup nastavení stránkového zaøízení --statusdict=K[:[:]V] po¹le na výstup nastavení 'statusdict' -k, --page-prefeed zapne 'page prefeed' -K, --no-page-prefeed vypne 'page prefeed'
tr: --prologue=DOSYA DOSYA.pro dosyasýný PostScript giriþi olarak al --ppd[=ANAHTAR] PPD'yi kendin seç [ya da ANAHTAR deðerini ver] -n, --copies=SAYI her sayfadan SAYI kopya bas -s, --sides=KÝP duplex KÝP'e geç (`1' ya da `simplex', `2' ya da `duplex', `tumble' -S, --setpagedevice=K[:V] çýktýya bir sayfa aygýtý tanýmý geçir --statusdict=K[:[:]V] çýktýya bir statusdict tanýmý geçir -k, --page-prefeed sayfa önbeslemesine izin ver -K, --no-page-prefeed sayfa önbeslemesi iznini kaldýr

source: Report bugs to <bug-a2ps@gnu.org>.
cs: Chyby v programu oznamujte na adrese <bug-a2ps@gnu.org> (pouze anglicky). Pøipomínky k pøekladu zasílejte na adresu <cs@li.org> (èesky).

source: Table of Content
cs: Obsah
tr: Ýçindekiler

source: cannot process `%s' which requires a2ps version %s
cs: `%s' nelze zpracovat - vy¾aduje a2ps verze %s
tr: `%s' iþlenemiyor, a2ps %s sürümü gerekli

source: cannot find file `%s'
cs: soubor `%s' nelze najít
tr: `%s' dosyasý bulunamýyor

source: automatic style selection cancelled
cs: automatická volba stylù vypnuta
tr: kendiliðinden stil seçimi kapatýldý

source: cannot compile regular expression `%s': %s
cs: regulární výraz `%s' nelze zkompilovat: %s
tr: `%s' düzgün deyimi derlenemiyor: %s

source: Known Style Sheets
cs: Pøipravené styly (jazyky)
tr: Tanýnan Stil Dosyalarý

source: cannot find style sheet `%s': using plain style
cs: styl `%s' nelze najít: pou¾it prostý styl
tr: `%s' stil dosyasý bulunamýyor: sade stil kullanýlýyor

source: invalid version number `%s'
cs: neplatné èíslo verze `%s'
tr: geçersiz sürüm numarasý `%s'

source: space (i.e., ` ')
cs: mezera (i.e. ` ')
tr: boþluk (yani ` ')

source: octal (i.e., `\001' etc.)
cs: osmièkovì (i.e. `\001' etc.)
tr: sekizli (yani `\001' gibi)

source: hexadecimal (i.e., `\x0a' etc.)
cs: ¹estnáctkovì (i.e. `\x0a' etc.)
tr: onaltýlý (yani `\x0a' gibi)

source: caret (i.e., `^C', `M-^C' etc.)
cs: karet (i.e. `^C', `M-^C' etc.)
tr: þapka (yani `^C', `M-^C' gibi)

source: question-mark (i.e., `?')
cs: otazník (i.e. `?')
tr: soru iþareti (yani `?')

source: invalid option `%s'
cs: neznámý pøepínaè `%s'
tr: geçersiz seçenek `%s'

source: Known Encodings
cs: Pøipravená kódování
tr: Tanýnan kodlamalar

source: incomplete knowledge of faces
cs: nejsou známy v¹echny tváøe
tr: yüzler hakkýnda yetersiz bilgi

source: cannot close directory `%s'
cs: adresáø `%s' nelze zavøít
tr: `%s' dizini kapatýlamýyor

source: invalid argument `%s' for `%s'
cs: neplatný argument `%s' pro pøepínaè `%s'
tr: `%2$s' için geçersiz argüman `%1$s'

source: Valid arguments are integers n such that: %s
cs: Platnými argumenty jsou celá èísla n, pro nì¾ platí: %s
tr: Geçerli argümanlar %s kuralýna uyan n tamsayýlarýdýr

source: Valid arguments are floats f such that: %s
cs: Platnými argumenty jsou reálná èísla f, pro nì¾ platí: %s
tr: Geçerli argümanlar %s kuralýna uyan f gerçel sayýlarýdýr

source: unknown encoding `%s'
cs: neznámé kódování `%s'
tr: tanýnmayan kodlama: `%s'

source: rows first
cs: nejdøíve øádky
tr: önce satýrlar

source: columns first
cs: nejdøíve sloupce
tr: önce sütunlar

source: unknown medium `%s'
cs: neznámé médium `%s'
tr: tanýnmayan ortam `%s'

source: Known Media
cs: Pøipravená média
tr: Tanýnan ortamlar

source: Name
cs: Jméno
tr: Ýsim

source: dimensions
cs: rozmìry
tr: boyutlar

source: Known Variables
cs: Pøipravené promìnné
tr: Bilinen Macro Meta Sequence'lar

source: %s: missing `%c' for %s%c escape
cs: %s: chybí `%c' pro øídící znak %s%c
tr: %1$s: %3$s%4$c kaçýþ dizgesinde `%2$c' eksik

source: Printed by %s
cs: Vytiskl %s
tr: Basan: %s

source: Printed by %s from %s
cs: Vytiskl %s z %s
tr: Basan: %s, Yer: %s

source: cannot get current working directory
cs: souèasný pracovní adresáø nelze urèit
tr: bulunulan dizin öðrenilemiyor

source: %s: too long argument for %s escape
cs: %s: pøíli¹ dlouhý argument pro øídící znak %s
tr: %s: %s kaçýþ dizgesi için çok uzun argüman

source: %A %B %d, %Y
cs: %A %d.%B %Y
tr: %d %B %Y, %A

source: %s: unknown `%s' escape `%c' (%d)
cs: %s: pro `%s' není øídící znak `%c' (%d) definován
tr: %s: tanýnmayan `%s' kaçýþ dizgesinde `%c' (%d)

source: %s: invalid separator `%s%c' for `%s' escape
cs: %s: neplatný separátor `%s%c' pro øídící znak `%s'
tr: %1$s: `%4$s' kaçýþ dizgesi için `%2$s%3$c' ayýrýcýsý hatalý

source: %s: invalid argument for %s%c escape
cs: %s: neplatný argument pro øídící znak %s%c
tr: %s: %s%c kaçýþ dizgesi için hatalý argüman

source: output command
cs: výstupní pøíkaz
tr: çýktý komutu

source: Try `%s --help' for more information.
cs: Více informací získáte pøíkazem `%s --help'.
tr: Daha çok bilgi almak için `%s --help' komutunu deneyin.

source: invalid variable identifier `%s'
cs: neplatné u¾ití promìnné `%s'
tr: geçersiz deðiþken adý `%s'

source: invalid face `%s'
cs: neznámý pøepínaè `%s'
tr: geçersiz yüz `%s'

source: `%s' with no matching `%s'
cs: `%s' bez odpovídajícího `%s'
tr: `%s' için karþýlýk olan bir `%s' yok

source: Known Fonts
cs: Pøipravená písma
tr: Tanýnan Yazýtipleri

source: None.
cs: ®ádná.
tr: Yok.

source: Known PostScript Printer Descriptions
cs: Pøipravené popisy tiskáren
tr: Tanýnan PostScript Yazýcý Betimlemeleri (PPD)

source: invalid interval `%s'
cs: nepovolený interval `%s'
tr: geçersiz aralýk %s

source: Default Printer
cs: implicitní tiskárna
tr: Öntanýmlý Yazýcý

source: Unknown Printer
cs: neznámá tiskárna
tr: Tanýnmayan Yazýcý

source: no command for the `%s' (%s%s)
cs: ¾ádný pøíkaz pro `%s' (%s%s)

source: sent to the standard output
cs: posláno na standardní výstup
tr: standart çýkýþa gönderildi

source: sent to the default printer
cs: posláno na implicitní tiskárnu
tr: öntanýmlý yazýcýya gönderildi

source: saved into the file `%s'
cs: ulo¾eno do souboru `%s'
tr: `%s' dosyasýna yazýldý

source: sent to the printer `%s'
cs: posláno na tiskárnu `%s'
tr: `%s' yazýcýsýna gönderildi

source: Known Outputs (Printers, etc.)
cs: Pøipravené výstupní cíle (tiskárny apod.)
tr: Tanýnan çýktý varýþlarý (yazýcýlar v.b.)

source: Known Prologues
cs: Pøipravené prology
tr: Tanýnan giriþler

source: font %f too big
cs: písmo %f je pøíli¹ veliké
tr: %f yazýtipi çok büyük

source: `%s' is a binary file, printing aborted
cs: `%s' je binární soubor, tisk ukonèen
tr: `%s' ikili bir dosya, basma iþlemi býrakýldý

source: user
cs: u¾ivatel
tr: kullanýcý

source: Unknown User
cs: neznámý u¾ivatel
tr: Tanýnmayan Kullanýcý

source: unknown user option `%s'
cs: neznámá u¾ivatelsky definovaná zkratka `%s'
tr: tanýnmayan kullanýcý seçeneði `%s'

source: Known User Options
cs: Pøipravené u¾ivatelsky definované zkratky
tr: Tanýnan kullanýcý seçenekleri

source: cannot rename file `%s' as `%s'
cs: soubor `%s' nelze pøejmenovat na `%s'
tr: `%s' dosyasýnýn adý `%s' olarak deðiþtirilemiyor

source: restored file `%s'
cs: soubor `%s' obnoven
tr: `%s' dosyasý kurtarýldý

source: Valid arguments are:
cs: Platné argumenty jsou:
tr: Geçerli argümanlar:

source: Unknown system error
cs: Neznámá systémová chyba
tr: Tanýnmayan sistem hatasý

source: Written by %s.
cs: Napsal %s.

source: page prefeed = %s
tr: sayfa önbesleme = %s

source: emacs (i.e., `C-c', `M-C-c' etc.)
tr: emacs (yani `C-c', `M-C-c' gibi)

source: Dynamic array `%s':
tr: Dinamik dizi `%s':

source: Dynamic string:
tr: Dinamik katar:
